system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.88 -0.02 0.20)  //0
    (2.12 -0.02 0.20)  //1
    (2.12  2.68 0.20) //2
    (0.88  2.68 0.20)  //3
    (0.88 -0.02 2.68)  //4
    (2.12 -0.02 2.68)  //5
    (2.12  2.68 2.68)  //6
    (0.88  2.68 2.68)  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (13 24 33) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
  type patch;
}
boundary ();

mergePatchPairs
(
);



// ************************************************************************* //
